barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountQueryProcessorTest_18.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header>
        <gbo:UCBRUHeaders xmlns:gbo="urn:imb:gbo:v2">
            <gbo:Correlation>
                <gbo:XRef>PHACCOUNT2333451</gbo:XRef>
            </gbo:Correlation>
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>PAYMENT_HUB</gbo:Application.Module>
                        <gbo:TimeStamp>2017-01-16T12:44:52Z</gbo:TimeStamp>
                    </gbo:Step>
                </gbo:MessagePath>
                <gbo:ProcessInfo>
                    <gbo:Name>PAYMENT_HUB</gbo:Name>
                    <gbo:InstanceId>57555-888-223-69652296</gbo:InstanceId>
                </gbo:ProcessInfo>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
		<bars:AccountListQuery xmlns:bars="urn:asbo:barsgl">
			<bars:AccountQuery>
				<bars:CustomerNo>00000018</bars:CustomerNo>
				<bars:AccountingType>111040100</bars:AccountingType>
				<bars:AccountingType>111040200</bars:AccountingType>
				<bars:AccountingType>161060101</bars:AccountingType>
				<bars:AccountingType>161060102</bars:AccountingType>
				<bars:AccountingType>161070101</bars:AccountingType>
				<bars:AccountingType>161070102</bars:AccountingType>
				<bars:AccountingType>354020301</bars:AccountingType>
				<bars:AccountingType>354020302</bars:AccountingType>
				<bars:AccountingType>354030101</bars:AccountingType>
				<bars:AccountingType>354040101</bars:AccountingType>
				<bars:AccountingType>355010101</bars:AccountingType>
				<bars:AccountingType>355010201</bars:AccountingType>
				<bars:AccountingType>355010301</bars:AccountingType>
				<bars:AccountingType>355010401</bars:AccountingType>
				<bars:AccountingType>355010501</bars:AccountingType>
				<bars:AccountingType>355010601</bars:AccountingType>
				<bars:AccountingType>355010901</bars:AccountingType>
				<bars:AccountingType>355011227</bars:AccountingType>
				<bars:AccountingType>355011228</bars:AccountingType>
				<bars:AccountingType>355020101</bars:AccountingType>
				<bars:AccountingType>355020201</bars:AccountingType>
				<bars:AccountingType>355020301</bars:AccountingType>
				<bars:AccountingType>355030101</bars:AccountingType>
				<bars:AccountingType>355040101</bars:AccountingType>
				<bars:AccountingType>355040201</bars:AccountingType>
				<bars:AccountingType>356030200</bars:AccountingType>
				<bars:AccountingType>358010202</bars:AccountingType>
				<bars:AccountingType>358010501</bars:AccountingType>
				<bars:AccountingType>358010701</bars:AccountingType>
				<bars:AccountingType>358010800</bars:AccountingType>
				<bars:AccountingType>358010901</bars:AccountingType>
				<bars:AccountingType>358011001</bars:AccountingType>
				<bars:AccountingType>358011101</bars:AccountingType>
				<bars:AccountingType>358011201</bars:AccountingType>
				<bars:AccountingType>358030201</bars:AccountingType>
				<bars:AccountingType>361040101</bars:AccountingType>
				<bars:AccountingType>361050301</bars:AccountingType>
				<bars:AccountingType>361050400</bars:AccountingType>
				<bars:AccountingType>361050501</bars:AccountingType>
				<bars:AccountingType>361060401</bars:AccountingType>
				<bars:AccountingType>361060501</bars:AccountingType>
				<bars:AccountingType>410030101</bars:AccountingType>
				<bars:AccountingType>425010101</bars:AccountingType>
				<bars:AccountingType>425010102</bars:AccountingType>
				<bars:AccountingType>426020101</bars:AccountingType>
				<bars:AccountingType>446010100</bars:AccountingType>
				<bars:AccountingType>447010101</bars:AccountingType>
				<bars:AccountingType>447010102</bars:AccountingType>
				<bars:AccountingType>448020101</bars:AccountingType>
				<bars:AccountingType>502010101</bars:AccountingType>
				<bars:AccountingType>502010202</bars:AccountingType>
				<bars:AccountingType>502010304</bars:AccountingType>
				<bars:AccountingType>502010405</bars:AccountingType>
				<bars:AccountingType>503010301</bars:AccountingType>
				<bars:AccountingType>503010306</bars:AccountingType>
				<bars:AccountingType>503010800</bars:AccountingType>
				<bars:AccountingType>503010901</bars:AccountingType>
				<bars:AccountingType>503011001</bars:AccountingType>
				<bars:AccountingType>503011101</bars:AccountingType>
				<bars:AccountingType>503011201</bars:AccountingType>
				<bars:AccountingType>503011403</bars:AccountingType>
				<bars:AccountingType>503011501</bars:AccountingType>
				<bars:AccountingType>503020101</bars:AccountingType>
				<bars:AccountingType>503020103</bars:AccountingType>
				<bars:AccountingType>503020110</bars:AccountingType>
				<bars:AccountingType>503020121</bars:AccountingType>
				<bars:AccountingType>503020125</bars:AccountingType>
				<bars:AccountingType>503020201</bars:AccountingType>
				<bars:AccountingType>503020203</bars:AccountingType>
				<bars:AccountingType>503020204</bars:AccountingType>
				<bars:AccountingType>503020208</bars:AccountingType>
				<bars:AccountingType>503020210</bars:AccountingType>
				<bars:AccountingType>503020221</bars:AccountingType>
				<bars:AccountingType>503020222</bars:AccountingType>
				<bars:AccountingType>503020225</bars:AccountingType>
				<bars:AccountingType>503030101</bars:AccountingType>
				<bars:AccountingType>503030201</bars:AccountingType>
				<bars:AccountingType>503030202</bars:AccountingType>
				<bars:AccountingType>503030301</bars:AccountingType>
				<bars:AccountingType>504010102</bars:AccountingType>
				<bars:AccountingType>504010103</bars:AccountingType>
				<bars:AccountingType>504010104</bars:AccountingType>
				<bars:AccountingType>504010106</bars:AccountingType>
				<bars:AccountingType>505010100</bars:AccountingType>
				<bars:AccountingType>505010200</bars:AccountingType>
				<bars:AccountingType>505010300</bars:AccountingType>
				<bars:AccountingType>505010401</bars:AccountingType>
				<bars:AccountingType>505010500</bars:AccountingType>
				<bars:AccountingType>505020201</bars:AccountingType>
				<bars:AccountingType>505030100</bars:AccountingType>
				<bars:AccountingType>505030201</bars:AccountingType>
				<bars:AccountingType>505030203</bars:AccountingType>
				<bars:AccountingType>512030403</bars:AccountingType>
				<bars:AccountingType>731020102</bars:AccountingType>
				<bars:AccountingType>789050501</bars:AccountingType>
				<bars:AccountingType>789050502</bars:AccountingType>
				<bars:AccountingType>789050503</bars:AccountingType>
				<bars:AccountingType>789050504</bars:AccountingType>
				<bars:AccountingType>891040201</bars:AccountingType>
			</bars:AccountQuery>
		</bars:AccountListQuery>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>